Repository: muhammedelsepa3y/Chat_App
Catalog: lib/Util/Locale/app_*.arb
Languages: ar

source: App Language
ar: لغة التطبيق

source: Back
ar: رجوع

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Change Language
ar: تغيير اللغة

source: French
ar: الفرنسية

source: Urdu
ar: الأوردو

source: Home
ar: الرئيسية

source: Settings
ar: الإعدادات

source: Orders
ar: الطلبات

source: Personal Information
ar: المعلومات الشخصية

source: Terms and Conditions
ar: الشروط والأحكام

source: Sign Out
ar: تسجيل الخروج

source: Share App
ar: مشاركة التطبيق

source: Security and Privacy
ar: الأمان والخصوصية

source: Technical Support
ar: الدعم الفني

source: Change
ar: تغيير

source: Name
ar: الإسم

source: Phone
ar: الهاتف

source: New Password
ar: الرقم السري الجديد

source: Save Updates
ar: حفظ التعديلات

# nameValidation
source: Name is required
ar: يجب إدخال الإسم

# phoneValidation
source: Valid phone number is required
ar: يجب إدخال رقم الهاتف صحيحا

# passwordValidation
source: New password is required
ar: يجب إدخال الرقم السري الجديد

# passwordChanged
source: Password changed successfully
ar: تم تغيير الرقم السري بنجاح

source: Password not changed
ar: لم يتم تغيير الرقم السري

# signOutConfirmation
source: Are you sure you want to sign out?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Yes
ar: نعم

source: No
ar: لا

source: Contact Us
ar: التواصل معنا

source: Please enter only numbers
ar: الرجاء إدخال أرقام فقط

source: Please enter valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

source: Please enter email
ar: الرجاء إدخال البريد الإلكتروني

source: Change Photo
ar: تغيير الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# updateDataSuccess
source: Data updated successfully
ar: تم تعديل البيانات بنجاح

# errorPleaseMakeSure
source: Error, please make sure you entered the correct data
ar: خطأ، الرجاء التأكد من البيانات

source: Monthly Umrah
ar: عمرة شهرية

source: Regular Umrah
ar: عمرة باقي الأيام

source: Ramadan Umrah
ar: عمرة شهر رمضان

source: Shabaan Umrah
ar: عمرة شعبان

source: Ragab Umrah
ar: عمرة رجب

source: Urgent Umrah
ar: عمرة مستعجلة

source: Pending Applications
ar: الطلبات المعلقة

# completedOrders
source: Completed Applications
ar: الطلبات المكتملة

source: Error, please try again
ar: حدث خطأ ما يرجي المحاولة مرة اخري

source: Login
ar: تسجيل الدخول

# registerNewAcc
source: Register New Account
ar: إنشاء حساب

# noAccount
source: Don't have an account?
ar: ليس لدي حساب

# iHaveAccount
source: I have an account
ar: لدي حساب بالفعل

# alreadyRegisteredAccount
source: This phone number is already registered, Please choose another phone number
ar: يوجد حساب بهذا الرقم فضلا استحدم رقم اخر

source: Forgot Password?
ar: نسيت الرقم السري

source: Hello to Umrah
ar: أهلاً بك في عمرة

# enterCorrectPhone
source: Please enter a correct phone number
ar: ادخل الرقم صحيحا

# phoneNum
source: Phone Number
ar: رقم التليفون

source: Password
ar: الرقم السري

# makeSurePassword
source: Make sure you entered the correct password
ar: تأكد من ادخال الرقم السري صحيحا

# notRegisteredAccountBefore
source: This phone number is not registered, Please use another phone number
ar: لا يوجد حساب بهذا الرقم فضلا استحدم رقم اخر

source: Save
ar: حفظ

# confirmEnterPassword
source: Please Enter your new password
ar: تأكد من إدخال الرقم السري الجديد

# passwordsNotMatch
source: Passwords do not match
ar: الرقم السري غير متطابق

source: New password saved successfully
ar: تم حفظ الرقم السري الجديد

source: Code sent successfully
ar: تم إرسال الكود بنجاح

# forgetPasswordTitle
source: Forget Password
ar: استعادة الرقم السري

# enterCodeWeSent
source: Enter the code we sent
ar: قم بكتابة الكود الذي أرسلناه

# toPhone
source: to your phone
ar: إلى رقم الهاتف

source: Next
ar: التالي

# sendCodeAgain
source: Sent code again
ar: إرسال مرة أخرى

# codeWillExpire
source: The code will expire in
ar: الكود سينتهي خلال

source: Login successfully
ar: تم تسجيل الدخول بنجاح

source: Logout successfully
ar: تم تسجيل الخروج بنجاح

source: Notifications
ar: الإشعارات

source: No notifications
ar: لا توجد إشعارات

source: Today
ar: اليوم

source: Yesterday
ar: أمس

source: AM
ar: صباحاً

source: PM
ar: مساءً

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

# pleaseEnterPhoneFirst
source: Please enter your phone number first
ar: الرجاء إدخال رقم الهاتف أولا

# registerTheNewAccount
source: Sign Up
ar: إنشاء الحساب

source: Confirm Password
ar: تأكيد الرقم السري

source: Sign up successfully
ar: تم التسجيل بنجاح

source: Password changed successfully
ar: تم تغيير الرقم السري بنجاح

source: Change Phone
ar: تغيير رقم الهاتف

# mobileChangedSuccessfully
source: Mobile number changed successfully
ar: تم تغيير رقم الهاتف بنجاح

source: Change Password
ar: تغيير الرقم السري

source: Current Orders
ar: الطلبات الحالية

source: Previous Orders
ar: الطلبات السابقة

# backToHomePage
source: Back to Home
ar: العودة للرئيسية

source: No previous orders
ar: لا يوجد طلبات سابقة

source: No current orders
ar: لا يوجد طلبات حالية

source: Umrah Date:
ar: تاريخ العمرة:

source: Service Provider:
ar: مقدم الخدمة:

source: Type:
ar: النوع:

source: Umrah:
ar: عمرة:

# umrahWithoutColon
source: Umrah
ar: عمرة

source: Not Assigned
ar: لم يتم التحديد

source: Monthly Umrah Bundle Service
ar: خدمة باقة عمرة شهرية

# monthlyUmrahBundleServiceText
source: We offer a monthly Umrah bundle service that provides you with one Umrah every month of the year to ensure you perform Umrah.
ar: نقدم خدمة باقة العمرة الشهرية التي توفر لك عمرة كل شهر من السنة لضمان اداء العمرة

source: Regular Umrah Service
ar: خدمة عمرة باقي الأيام

source: Ramadan Umrah Service
ar: خدمة عمرة شهر رمضان

source: Urgent Umrah Service
ar: خدمة عمرة مستعجلة

source: Umrah Owner Name
ar: إسم صاحب العمرة

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

# completeProcess
source: Continue Process
ar: أكمل العملية

# umrahOwnerNameValidation
source: Umrah Owner Name is required
ar: يجب إدخال إسم صاحب العمرة

# umrahOwnerGenderValidation
source: Umrah Owner Gender is required
ar: يجب إختيار الجنس

source: Recording the name vocally
ar: تسجيل الإسم صوتيا

# recordingTheNameVocallyValidation
source: Recording the name vocally is required
ar: يجب تسجيل الإسم صوتيا

source: Recording ..
ar: جاري التسجيل ..

# umrahClientInstruction1
source: The Umrah service provider will make the intention after entering ihram
ar: سيقوم مؤدي العمرة بعقد النية بعد الإحرام

# umrahClientInstruction2
source: The service provider will inform you upon arrival at the Haram
ar: سيعلمك مؤدي الخدمة عند الوصول إلى الحرم

# umrahClientInstruction3
source: The service provider will inform you upon completing the tawaf
ar: سيعلمك مؤدي الخدمة عند الإنتهاء من الطواف

# umrahClientInstruction4
source: The service provider will inform you upon completing the sa'i
ar: سيعلمك مؤدي الخدمة عند الإنتهاء من السعي

# umrahClientInstruction5
source: The service provider will inform you upon completing the Umrah and shaving or cutting the hair
ar: سيعلمك مؤدي الخدمة عند الإنتهاء من العمرة وحلق او قص الشعر

source: Download Completion Certificate
ar: تحميل شهادة الإتمام

source: Pay Now
ar: إدفع الآن

source: Umrah service will apply in
ar: سيتم تطبيق خدمة العمرة في خلال

source: Total
ar: الإجمالي

# daysAndWillContactYouBefore
source: days and we will contact you before
ar: أيام وسيتم التواصل معك قبلها

# successPayment
source: Payment Successful
ar: تم الدفع بنجاح

source: Back to Home
ar: العودة للصفحة الرئيسية

source: Error
ar: حدث خطأ

# errorPaymentText
source: Error in payment, please try again
ar: يبدو ان هناك خطأ حدث في عملية الدفع

source: Try Again
ar: المحاولة مرة أخرى

# umrahServiceProvidersSettings
source: Umrah Providers Settings
ar: إعدادات مؤدين العمرة

# umrahServiceProvidersSettingsText
source: Number of Umrah can be performed by the service provider
ar: عدد مرات العمرة التي يمكن لمؤدي العمرة ادائها خلال شهر

# umrahNumberValidation
source: Umrah number is required
ar: يجب ادخال الرقم

# successUpdatingNumOfUmrah
source: Number of Umrah updated successfully
ar: تم تحديث عدد مرات العمرة بنجاح

source: General Settings
ar: الإعدادات العامة

source: Umrah Settings
ar: إعدادات العمرة

source: Profile Settings
ar: إعدادات الحساب الشخصي

source: Pending Orders
ar: الطلبات المعلقة

source: See All
ar: انظر الكل

source: Service Providers
ar: مؤدين الخدمة

# remainingUmrahs
source: Remaining Umrahs in this month
ar: عدد العمرات المتبقي هذا الشهر

source: No service providers
ar: لا يوجد مؤدين خدمة

source: No pending umrahs
ar: لا يوجد عمرات معلقة

source: Shabaan Umrah Service
ar: خدمة عمرة شعبان

source: Ragab Umrah Service
ar: خدمة عمرة رجب

source: Order Date:
ar: تاريخ الطلب:

# oneDayLeft
source: 1 day left
ar: باقي 1 يوم

source: Late
ar: تأخير

source: day
ar: يوم

source: days
ar: أيام

source: Search
ar: البحث

# noResults
source: The name you are searching for is not available
ar: غير متوفر الإسم الذي تبحث عنه

source: Execution Day
ar: يوم التنفيذ

source: Add Service Provider
ar: إضافة مقدم خدمة

source: Add Photo
ar: أضف صورة

source: Remove Photo
ar: احذف الصورة

source: loading ..
ar: جاري التحميل

source: New provider added successfully
ar: تم إضافة مقدم الخدمة بنجاح

source: No data
ar: لا يوجد بيانات

source: Edit Data
ar: تعديل البيانات

source: Phone Number
ar: رقم الهاتف

source: Service History
ar: سجل الخدمة

source: Delete Account
ar: حذف الحساب

source: Edit
ar: تعديل

source: Add Umrah
ar: إضافة عمرة

source: Choose Umrah Type
ar: اختر نوع العمرة

source: Add Price in SAR
ar: أضف السعر بالريال السعودي

# addNumberOfDays
source: Add the days for performing Umrah
ar: أضف عدد الأيام لأداء العمرة

source: Add
ar: إضافة

source: No Umrah added
ar: لم يتم إضافة عمرات

# deleteUmrahText
source: Are you sure you want to remove the Umrah?
ar: هل أنت واثق من إزالة العمرة

source: Delete
ar: إزالة

source: Cancel
ar: إلغاء

source: Price in SAR
ar: السعر بالريال السعودي

# numberOfDays
source: The days for performing Umrah
ar: الأيام لأداء العمرة

# deleteUmrahSuccess
source: Umrah deleted successfully
ar: تم حذف العمرة بنجاح

# updateUmrahSuccess
source: Umrah updated successfully
ar: تم تحديث العمرة بنجاح

# enterValidData
source: Please enter valid data
ar: الرجاء إدخال بيانات صحيحة

source: Umrah Type
ar: نوع العمرة

# addUmrahSuccessfully
source: Umrah added successfully
ar: تم إضافة العمرة بنجاح

source: No Umrah remaining to add
ar: لا يوجد عمرات متاحة للإضافة

source: Saved successfully
ar: تم الحفظ بنجاح

# errorHasOccurred
source: An error has occurred
ar: حدث خطأ

# errorInAddingProvider
source: It seems that an error occurred during the process of adding a service provider
ar: يبدو ان هناك خطأ حدث في عملية اضافة مؤدي خدمة

# successAddingProvider
source: The service provider's data has been saved
ar: تم حفظ بيانات مؤدي الخدمة

source: No service history
ar: لا يوجد سجل خدمة

# deleteProviderText
source: Are you sure you want to delete the account?
ar: هل أنت واثق من حذف الحساب؟

source: Update Picture
ar: تغيير صورة

# errorInUpdatingProvider
source: It seems that an error occurred during the process of modifying the service provider's data
ar: يبدو ان هناك خطأ حدث في عملية تعديل بيانات مؤدي خدمة

source: Convert Umrah to
ar: تحويل العمرة إلى

source: Convert
ar: تحويل

source: Confirm
ar: تأكيد

# errorTextInConvertingUmrah
source: It seems that an error occurred during the process of converting the Umrah
ar: يبدو ان هناك خطأ حدث في تحويل العمرة

# successConvertingUmrah
source: The Umrah has been converted successfully
ar: تم تحويل العمرة بنجاح

# numOfMonthlyUmrahs
source: Number of monthly Umrahs
ar: عدد عمرات الشهر

# numOfYourUmrahs
source: Number of your Umrahs
ar: عدد عمراتك

# theAdminTransfered
source: The admin has transferred
ar: قام الأدمن بتحويل

source: Reject
ar: رفض

source: Umrah Orders
ar: طلبات العمرة

# endUmrahValidation
source: Are you sure you want to end the Umrah?
ar: هل أنت واثق من إنهاء العمرة

source: End
ar: إنهاء

source: End Umrah
ar: إنهاء العمرة

source: Current Umrah
ar: العمرة الحالية

# notificationSendThatYouAcceptUmrah
source: A notification has been sent confirming your acceptance of the Umrah
ar: تم إرسال إشعار بإستلامك للعمرة

# uploadUmrahMediaFiles
source: Upload Umrah Media
ar: تحميل الوسائط الخاصة بالعمرة

source: Upload Media
ar: تحميل الوسائط

source: Intention Contract
ar: عقد النية

# sanctuaryPicture
source: Sanctuary End
ar: الوصول للحرم

source: Circumambulation End
ar: انتهاء الطواف

source: Ihram End
ar: انتهاء الإحرام

source: Quest End
ar: انتهاء السعى

source: Share Media
ar: نشر الوسائط

source: Video
ar: فيديو

source: Image
ar: صورة

# successDeletingProvider
source: The account has been deleted successfully
ar: تم حذف مقدم الخدمة بنجاح

source: Media Shared Successfully
ar: تم نشر الوسائط بنجاح

source: Please Upload All Media
ar: يرجى تحميل جميع الوسائط

# successCancelingUmrah
source: Umrah canceled successfully
ar: تم إلغاء العمرة بنجاح

# pleaseSelectServiceProvider
source: Please select a service provider
ar: الرجاء اختيار مقدم الخدمة

source: Umrah Deleted Successfully
ar: تم إنهاء العمرة بنجاح

source: Pay with card for
ar: الدفع بالبطاقة لـ

# applyOnUmrahText
source: Are you sure you want to apply on this Umrah?
ar: هل أنت واثق من قبول طلب العمرة؟

source: Perform Umrah
ar: تأدية العمرة

source: No data updated
ar: لا يوجد بيانات تم تحديثها

source: Status
ar: الحالة

source: Completed
ar: مكتمل

source: In Progress
ar: قيد التنفيذ

source: Download
ar: تحميل
